tests/load/example-test.yaml
config:
  target: 'https://localhost:62985'
  processor: './functions.js'
  phases:
    - duration: 10
      arrivalRate: 100
scenarios:
  - name: 'Create a user'
    flow:
      - function: createEmail
      - get:
          url: '/Identity/Account/Register'
          capture:
            - selector: '[name=__RequestVerificationToken]'
              attr: 'value'
              as: 'requestToken'
      - log: 'Got {{requestToken}}'
      - post: 
          url: '/Identity/Account/Register'
          form:
            'Input.Email': '{{email}}'
            'Input.Password': '{{password}}'
            'Input.ConfirmPassword': '{{password}}'
            '__RequestVerificationToken': '{{requestToken}}'
      - log: 'Crated a user with {{email}} and {{password}}'